tiborsimon/embedded-tdd-headers/pic/8bit/pic18f65k90_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F65K90_H_
#define _PIC18F65K90_H_

#define LCDCON                        0
#define LMUX0                         1
#define LMUX                          2
#define LMUX1                         3
#define LCDCON_CS                     4
#define CS0                           5
#define CS1                           6
#define WERR                          7
#define SLPEN                         8
#define LCDEN                         9
#define LCDPS                         10
#define LP                            11
#define LP0                           12
#define LP1                           13
#define LP2                           14
#define LP3                           15
#define WA                            16
#define LCDA                          17
#define BIASMD                        18
#define WFT                           19
#define LCDSE0                        20
#define SE00                          21
#define SE01                          22
#define SE02                          23
#define SE03                          24
#define SE04                          25
#define SE05                          26
#define SE06                          27
#define SE07                          28
#define LCDSE1                        29
#define SE08                          30
#define SE09                          31
#define SE10                          32
#define SE11                          33
#define SE12                          34
#define SE13                          35
#define SE14                          36
#define SE15                          37
#define LCDSE2                        38
#define SE16                          39
#define SE17                          40
#define SE18                          41
#define SE19                          42
#define SE20                          43
#define SE21                          44
#define SE22                          45
#define SE23                          46
#define LCDSE3                        47
#define SE24                          48
#define SE25                          49
#define SE26                          50
#define SE27                          51
#define SE28                          52
#define SE29                          53
#define SE30                          54
#define SE31                          55
#define LCDSE4                        56
#define SE32                          57
#define LCDRL                         58
#define LRLAT0                        59
#define LRLAT                         60
#define LRLAT1                        61
#define LRLAT2                        62
#define LCDIRI                        63
#define LRLBP                         64
#define LRLBP0                        65
#define LRLBP1                        66
#define LRLAP0                        67
#define LRLAP                         68
#define LRLAP1                        69
#define LCDREF                        70
#define VLCD1PE                       71
#define VLCD2PE                       72
#define VLCD3PE                       73
#define LCDCST0                       74
#define LCDCST                        75
#define LCDCST1                       76
#define LCDCST2                       77
#define LCDIRS                        78
#define LCDIRE                        79
#define SSP2CON2                      80
#define SEN2                          81
#define SSP2CON2_SEN                  82
#define ADMSK12                       83
#define SSP2CON2_RSEN                 84
#define RSEN2                         85
#define SSP2CON2_ADMSK1               86
#define ADMSK22                       87
#define PEN2                          88
#define SSP2CON2_PEN                  89
#define SSP2CON2_ADMSK2               90
#define ADMSK32                       91
#define SSP2CON2_RCEN                 92
#define RCEN2                         93
#define SSP2CON2_ADMSK3               94
#define ACKEN2                        95
#define ADMSK42                       96
#define SSP2CON2_ADMSK4               97
#define SSP2CON2_ACKEN                98
#define ACKDT2                        99
#define ADMSK52                       100
#define SSP2CON2_ACKDT                101
#define SSP2CON2_ADMSK5               102
#define SSP2CON2_ACKSTAT              103
#define ACKSTAT2                      104
#define SSP2CON2_GCEN                 105
#define GCEN2                         106
#define SSP2CON1                      107
#define SSP2CON1_SSPM                 108
#define SSP2CON1_SSPM0                109
#define SSPM02                        110
#define SSPM12                        111
#define SSP2CON1_SSPM1                112
#define SSP2CON1_SSPM2                113
#define SSPM22                        114
#define SSPM32                        115
#define SSP2CON1_SSPM3                116
#define SSP2CON1_CKP                  117
#define CKP2                          118
#define SSPEN2                        119
#define SSP2CON1_SSPEN                120
#define SSPOV2                        121
#define SSP2CON1_SSPOV                122
#define WCOL2                         123
#define SSP2CON1_WCOL                 124
#define SSP2STAT                      125
#define SSP2STAT_BF                   126
#define BF2                           127
#define SSP2STAT_UA                   128
#define UA2                           129
#define SSP2STAT_R_W                  130
#define SSP2STAT_I2C_READ             131
#define RW2                           132
#define SSP2STAT_R                    133
#define SSP2STAT_nW                   134
#define READ_WRITE2                   135
#define nW2                           136
#define SSP2STAT_nWRITE               137
#define I2C_READ2                     138
#define SSP2STAT_R_NOT_W              139
#define R_nW2                         140
#define SSP2STAT_READ_WRITE           141
#define nWRITE2                       142
#define R_W2                          143
#define SSP2STAT_R_nW                 144
#define SSP2STAT_NOT_WRITE            145
#define SSP2STAT_S                    146
#define S2                            147
#define START2                        148
#define SSP2STAT_I2C_START            149
#define I2C_START2                    150
#define P2                            151
#define SSP2STAT_I2C_STOP             152
#define SSP2STAT_P                    153
#define STOP2                         154
#define I2C_STOP2                     155
#define I2C_DAT2                      156
#define SSP2STAT_D                    157
#define DATA_ADDRESS2                 158
#define SSP2STAT_D_NOT_A              159
#define SSP2STAT_I2C_DAT              160
#define D_A2                          161
#define SSP2STAT_NOT_ADDRESS          162
#define SSP2STAT_D_nA                 163
#define SSP2STAT_DATA_ADDRESS         164
#define SSP2STAT_nADDRESS             165
#define nA2                           166
#define DA2                           167
#define nADDRESS2                     168
#define D_nA2                         169
#define SSP2STAT_nA                   170
#define SSP2STAT_D_A                  171
#define SSP2STAT_CKE                  172
#define CKE2                          173
#define SSP2STAT_SMP                  174
#define SMP2                          175
#define MSK02                         176
#define SSP2ADD                       177
#define SSP2ADD_MSK0                  178
#define MSK12                         179
#define SSP2ADD_MSK1                  180
#define MSK22                         181
#define SSP2ADD_MSK2                  182
#define MSK32                         183
#define SSP2ADD_MSK3                  184
#define MSK42                         185
#define SSP2ADD_MSK4                  186
#define MSK52                         187
#define SSP2ADD_MSK5                  188
#define MSK62                         189
#define SSP2ADD_MSK6                  190
#define MSK72                         191
#define SSP2ADD_MSK7                  192
#define SSP2BUF                       193
#define T4CON                         194
#define T4CKPS0                       195
#define T4CKPS                        196
#define T4CKPS1                       197
#define TMR4ON                        198
#define T4OUTPS                       199
#define T4OUTPS0                      200
#define T4OUTPS1                      201
#define T4OUTPS2                      202
#define T4OUTPS3                      203
#define PR4                           204
#define TMR4                          205
#define CCP7CON                       206
#define CCP7M0                        207
#define CCP7M                         208
#define CCP7M1                        209
#define CCP7M2                        210
#define CCP7M3                        211
#define DC7B                          212
#define CCP7Y                         213
#define DC7B0                         214
#define CCP7X                         215
#define DC7B1                         216
#define CCPR7L                        217
#define CCPR7H                        218
#define CCP6CON                       219
#define CCP6M                         220
#define CCP6M0                        221
#define CCP6M1                        222
#define CCP6M2                        223
#define CCP6M3                        224
#define CCP6Y                         225
#define DC6B0                         226
#define DC6B                          227
#define DC6B1                         228
#define CCP6X                         229
#define CCPR6L                        230
#define CCPR6H                        231
#define CCP5CON                       232
#define CCP5M0                        233
#define CCP5M                         234
#define CCP5M1                        235
#define CCP5M2                        236
#define CCP5M3                        237
#define CCP5Y                         238
#define DC5B0                         239
#define DC5B                          240
#define CCP5X                         241
#define DC5B1                         242
#define CCPR5L                        243
#define CCPR5H                        244
#define CCP4CON                       245
#define CCP4M                         246
#define CCP4M0                        247
#define CCP4M1                        248
#define CCP4M2                        249
#define CCP4M3                        250
#define CCP4Y                         251
#define DC4B0                         252
#define DC4B                          253
#define CCP4X                         254
#define DC4B1                         255
#define CCPR4L                        256
#define CCPR4H                        257
#define T5GCON                        258
#define T5GSS                         259
#define T5GSS0                        260
#define T5GSS1                        261
#define T5GVAL                        262
#define T5GGO_NOT_T5DONE              263
#define nT5DONE                       264
#define T5GGO_nT5DONE                 265
#define NOT_T5DONE                    266
#define T5GGO                         267
#define T5GSPM                        268
#define T5GTM                         269
#define T5GPOL                        270
#define TMR5GE                        271
#define T5CON                         272
#define TMR5ON                        273
#define T5CON_RD16                    274
#define RD165                         275
#define nT5SYNC                       276
#define NOT_T5SYNC                    277
#define SOSCEN5                       278
#define T5CON_SOSCEN                  279
#define T5CKPS                        280
#define T5CKPS0                       281
#define T5CKPS1                       282
#define TMR5CS0                       283
#define TMR5CS                        284
#define TMR5CS1                       285
#define TMR5L                         286
#define TMR5H                         287
#define PMD3                          288
#define CCP4MD                        289
#define CCP5MD                        290
#define CCP6MD                        291
#define CCP7MD                        292
#define CCP8MD                        293
#define PMD2                          294
#define CMP1MD                        295
#define CMP2MD                        296
#define CMP3MD                        297
#define TMR5MD                        298
#define TMR6MD                        299
#define TMR8MD                        300
#define PMD1                          301
#define TMR1MD                        302
#define TMR2MD                        303
#define TMR3MD                        304
#define TMR4MD                        305
#define RTCCMD                        306
#define CTMUMD                        307
#define PMD0                          308
#define ADCMD                         309
#define SSP1MD                        310
#define SPI1MD                        311
#define SPI2MD                        312
#define SSP2MD                        313
#define UART1MD                       314
#define UART2MD                       315
#define CCP1MD                        316
#define CCP2MD                        317
#define CCP3MD                        318
#define PSTR3CON                      319
#define PSTR3CON_STRA                 320
#define STRA3                         321
#define STRB3                         322
#define PSTR3CON_STRB                 323
#define PSTR3CON_STRC                 324
#define STRC3                         325
#define STRD3                         326
#define PSTR3CON_STRD                 327
#define STRSYNC3                      328
#define PSTR3CON_STRSYNC              329
#define PSTR3CON_CMPL0                330
#define CMPL03                        331
#define PSTR3CON_CMPL                 332
#define CMPL13                        333
#define PSTR3CON_CMPL1                334
#define PSTR2CON                      335
#define PSTR2CON_STRA                 336
#define P2DC02                        337
#define STRA2                         338
#define P2DC0CON                      339
#define STRB2                         340
#define P2DC12                        341
#define PSTR2CON_STRB                 342
#define P2DC1CON                      343
#define STRC2                         344
#define PSTR2CON_STRC                 345
#define P2DC22                        346
#define P2DC2CON                      347
#define P2DC32                        348
#define STRD2                         349
#define PSTR2CON_STRD                 350
#define P2DC3CON                      351
#define P2DC4CON                      352
#define STRSYNC2                      353
#define PSTR2CON_STRSYNC              354
#define P2DC42                        355
#define P2DC6CON                      356
#define PSTR2CON_CMPL                 357
#define CMPL02                        358
#define P2DC62                        359
#define PSTR2CON_CMPL0                360
#define CMPL12                        361
#define PSTR2CON_CMPL1                362
#define TXREG2                        363
#define RCREG2                        364
#define SPBRG2                        365
#define SPBRGH2                       366
#define BAUDCON2                      367
#define ABDEN2                        368
#define BAUDCON2_ABDEN                369
#define WUE2                          370
#define BAUDCON2_WUE                  371
#define BRG162                        372
#define BAUDCON2_BRG16                373
#define SCKP2                         374
#define TXCKP2                        375
#define BAUDCON2_TXCKP                376
#define DTRXP2                        377
#define RXDTP2                        378
#define BAUDCON2_RXDTP                379
#define RCMT2                         380
#define RCIDL2                        381
#define BAUDCON2_RCIDL                382
#define BAUDCON2_ABDOVF               383
#define ABDOVF2                       384
#define TXSTA2                        385
#define TX9D2                         386
#define TXSTA2_TX9D                   387
#define TXD82                         388
#define TRMT2                         389
#define TXSTA2_TRMT                   390
#define BRGH2                         391
#define TXSTA2_BRGH                   392
#define SENDB2                        393
#define TXSTA2_SENDB                  394
#define TXSTA2_SYNC                   395
#define SYNC2                         396
#define TXEN2                         397
#define TXSTA2_TXEN                   398
#define TX8_92                        399
#define TX92                          400
#define TXSTA2_TX9                    401
#define TXSTA2_CSRC                   402
#define CSRC2                         403
#define RCSTA2                        404
#define RCD82                         405
#define RX9D2                         406
#define RCSTA2_RX9D                   407
#define OERR2                         408
#define RCSTA2_OERR                   409
#define FERR2                         410
#define RCSTA2_FERR                   411
#define ADDEN2                        412
#define RCSTA2_ADDEN                  413
#define RCSTA2_CREN                   414
#define CREN2                         415
#define SREN2                         416
#define RCSTA2_SREN                   417
#define RC92                          418
#define RC8_92                        419
#define RCSTA2_RX9                    420
#define RX92                          421
#define RCSTA2_SPEN                   422
#define SPEN2                         423
#define ANCON2                        424
#define PCFG16                        425
#define ANSEL16                       426
#define PCFG17                        427
#define ANSEL17                       428
#define PCFG18                        429
#define ANSEL18                       430
#define PCFG19                        431
#define ANSEL19                       432
#define ANCON1                        433
#define ANSEL8                        434
#define PCFG8                         435
#define ANSEL9                        436
#define PCFG9                         437
#define PCFG10                        438
#define ANSEL10                       439
#define ANSEL11                       440
#define PCFG11                        441
#define ANCON0                        442
#define ANSEL0                        443
#define PCFG0                         444
#define ANSEL1                        445
#define PCFG1                         446
#define ANSEL2                        447
#define PCFG2                         448
#define ANSEL3                        449
#define PCFG3                         450
#define ANSEL4                        451
#define PCFG4                         452
#define ANSEL5                        453
#define PCFG5                         454
#define ANSEL6                        455
#define PCFG6                         456
#define ANSEL7                        457
#define PCFG7                         458
#define ODCON3                        459
#define CTMUDS                        460
#define U1OD                          461
#define U2OD                          462
#define ODCON2                        463
#define CCP3OD                        464
#define CCP4OD                        465
#define CCP5OD                        466
#define CCP6OD                        467
#define CCP7OD                        468
#define CCP8OD                        469
#define ODCON1                        470
#define SPI2OD                        471
#define CCP1OD                        472
#define CCP2OD                        473
#define SPI1OD                        474
#define REFOCON                       475
#define RODIV0                        476
#define RODIV                         477
#define RODIV1                        478
#define RODIV2                        479
#define RODIV3                        480
#define ROSEL                         481
#define ROSSLP                        482
#define ROON                          483
#define CCPTMRS2                      484
#define C8TSEL0                       485
#define C8TSEL                        486
#define C8TSEL1                       487
#define CCPTMRS1                      488
#define C4TSEL                        489
#define C4TSEL0                       490
#define C4TSEL1                       491
#define C5TSEL0                       492
#define C6TSEL0                       493
#define C7TSEL                        494
#define C7TSEL0                       495
#define C7TSEL1                       496
#define CCPTMRS0                      497
#define C1TSEL0                       498
#define C1TSEL                        499
#define C1TSEL1                       500
#define C1TSEL2                       501
#define C2TSEL0                       502
#define C2TSEL                        503
#define C2TSEL1                       504
#define C2TSEL2                       505
#define C3TSEL0                       506
#define C3TSEL                        507
#define C3TSEL1                       508
#define CM3CON                        509
#define CM3CON_CCH                    510
#define CCH03                         511
#define CM3CON_CCH0                   512
#define CCH13                         513
#define CM3CON_CCH1                   514
#define CM3CON_CREF                   515
#define CREF3                         516
#define CM3CON_EVPOL                  517
#define EVPOL03                       518
#define CM3CON_EVPOL0                 519
#define CM3CON_EVPOL1                 520
#define EVPOL13                       521
