tiborsimon/embedded-tdd-headers/pic/8bit/pic18f65k90_tdd.h
#define CM3CON_CPOL                   522
#define CPOL3                         523
#define COE3                          524
#define CM3CON_COE                    525
#define CM3CON_CON                    526
#define CON3                          527
#define CM2CON                        528
#define CM2CON_CCH                    529
#define CM2CON_CCH0                   530
#define CCH02                         531
#define CCH12                         532
#define CM2CON_CCH1                   533
#define CM2CON_CREF                   534
#define CREF2                         535
#define CM2CON_EVPOL                  536
#define EVPOL02                       537
#define CM2CON_EVPOL0                 538
#define EVPOL12                       539
#define CM2CON_EVPOL1                 540
#define CM2CON_CPOL                   541
#define CPOL2                         542
#define CM2CON_COE                    543
#define COE2                          544
#define CM2CON_CON                    545
#define CON2                          546
#define T8CON                         547
#define T8CKPS0                       548
#define T8CKPS                        549
#define T8CKPS1                       550
#define TMR8ON                        551
#define T8OUTPS                       552
#define T8OUTPS0                      553
#define T8OUTPS1                      554
#define T8OUTPS2                      555
#define T8OUTPS3                      556
#define PR8                           557
#define TMR8                          558
#define T6CON                         559
#define T6CKPS0                       560
#define T6CKPS                        561
#define T6CKPS1                       562
#define TMR6ON                        563
#define T6OUTPS0                      564
#define T6OUTPS                       565
#define T6OUTPS1                      566
#define T6OUTPS2                      567
#define T6OUTPS3                      568
#define PR6                           569
#define TMR6                          570
#define CCP8CON                       571
#define CCP8M0                        572
#define CCP8M                         573
#define CCP8M1                        574
#define CCP8M2                        575
#define CCP8M3                        576
#define DC8B0                         577
#define CCP8Y                         578
#define DC8B                          579
#define DC8B1                         580
#define CCP8X                         581
#define CCPR8L                        582
#define CCPR8H                        583
#define CCP3CON                       584
#define CCP3M                         585
#define CCP3M0                        586
#define CCP3M1                        587
#define CCP3M2                        588
#define CCP3M3                        589
#define CCP3Y                         590
#define DC3B                          591
#define DC3B0                         592
#define DC3B1                         593
#define CCP3X                         594
#define P3M                           595
#define P3M0                          596
#define P3M1                          597
#define CCPR3L                        598
#define CCPR3H                        599
#define ECCP3DEL                      600
#define P3DC                          601
#define P3DC0                         602
#define P3DC1                         603
#define P3DC2                         604
#define P3DC3                         605
#define P3DC4                         606
#define P3DC5                         607
#define P3DC6                         608
#define P3RSEN                        609
#define PSS3BD0                       610
#define PSS3BD                        611
#define PSS3BD1                       612
#define PSS3AC0                       613
#define PSS3AC                        614
#define PSS3AC1                       615
#define ECCP3AS                       616
#define ECCP3AS0                      617
#define ECCP3AS1                      618
#define ECCP3AS2                      619
#define ECCP3ASE                      620
#define CCP2CON                       621
#define CCP2M                         622
#define CCP2M0                        623
#define CCP2M1                        624
#define CCP2M2                        625
#define CCP2M3                        626
#define DC2B                          627
#define DC2B0                         628
#define CCP2Y                         629
#define DC2B1                         630
#define CCP2X                         631
#define P2M                           632
#define P2M0                          633
#define P2M1                          634
#define CCPR2L                        635
#define CCPR2H                        636
#define ECCP2DEL                      637
#define P2DC                          638
#define P2DC0                         639
#define P2DC1                         640
#define P2DC2                         641
#define P2DC3                         642
#define P2DC4                         643
#define P2DC5                         644
#define P2DC6                         645
#define P2RSEN                        646
#define PSS2BD                        647
#define PSS2BD0                       648
#define PSS2BD1                       649
#define PSS2AC0                       650
#define PSS2AC                        651
#define PSS2AC1                       652
#define ECCP2AS0                      653
#define ECCP2AS                       654
#define ECCP2AS1                      655
#define ECCP2AS2                      656
#define ECCP2ASE                      657
#define PADCFG1                       658
#define RTSECSEL0                     659
#define RTSECSEL                      660
#define RTSECSEL1                     661
#define REPU                          662
#define RDPU                          663
#define CM1CON                        664
#define CM1CON_CCH                    665
#define C1CH0                         666
#define CM1CON_CCH0                   667
#define CCH01                         668
#define CCH11                         669
#define C1CH1                         670
#define CM1CON_CCH1                   671
#define CM1CON_CREF                   672
#define CREF1                         673
#define EVPOL01                       674
#define CM1CON_EVPOL0                 675
#define CM1CON_EVPOL                  676
#define CM1CON_EVPOL1                 677
#define EVPOL11                       678
#define CM1CON_CPOL                   679
#define CPOL1                         680
#define CM1CON_COE                    681
#define COE1                          682
#define CM1CON_CON                    683
#define CON1                          684
#define CTMUICON                      685
#define IRNG                          686
#define IRNG0                         687
#define IRNG1                         688
#define ITRIM0                        689
#define ITRIM                         690
#define ITRIM1                        691
#define ITRIM2                        692
#define ITRIM3                        693
#define ITRIM4                        694
#define ITRIM5                        695
#define CTMUCONL                      696
#define EDG1STAT                      697
#define EDG2STAT                      698
#define EDG1SEL                       699
#define EDG1SEL0                      700
#define EDG1SEL1                      701
#define EDG1POL                       702
#define EDG2SEL0                      703
#define EDG2SEL                       704
#define EDG2SEL1                      705
#define EDG2POL                       706
#define CTMUCONH                      707
#define CTTRIG                        708
#define IDISSEN                       709
#define EDGSEQEN                      710
#define EDGEN                         711
#define TGEN                          712
#define CTMUSIDL                      713
#define CTMUEN                        714
#define ALRMVALL                      715
#define ALRMVALH                      716
#define ALRMRPT                       717
#define ARPT0                         718
#define ARPT                          719
#define ARPT1                         720
#define ARPT2                         721
#define ARPT3                         722
#define ARPT4                         723
#define ARPT5                         724
#define ARPT6                         725
#define ARPT7                         726
#define ALRMCFG                       727
#define ALRMPTR                       728
#define ALRMPTR0                      729
#define ALRMPTR1                      730
#define AMASK0                        731
#define AMASK                         732
#define AMASK1                        733
#define AMASK2                        734
#define AMASK3                        735
#define CHIME                         736
#define ALRMEN                        737
#define RTCVALL                       738
#define WAITE0                        739
#define RTCVALH                       740
#define WAITE1                        741
#define WAITM0                        742
#define WAITM1                        743
#define WAITM2                        744
#define WAITM3                        745
#define WAITB0                        746
#define WAITB1                        747
#define RTCCAL                        748
#define CAL0                          749
#define CAL                           750
#define CAL1                          751
#define CAL2                          752
#define CAL3                          753
#define CAL4                          754
#define CAL5                          755
#define CAL6                          756
#define CAL7                          757
#define RTCCFG                        758
#define RTCPTR0                       759
#define RTCPTR                        760
#define RTCPTR1                       761
#define RTCOE                         762
#define HALFSEC                       763
#define RTCSYNC                       764
#define RTCWREN                       765
#define RTCEN                         766
#define PIE6                          767
#define CMP1IE                        768
#define CMP2IE                        769
#define CMP3IE                        770
#define EEIE                          771
#define EEDATA                        772
#define EEADR                         773
#define EEADRH                        774
#define OSCCON2                       775
#define MFIOSEL                       776
#define MFIOFS                        777
#define SOSCGO                        778
#define SOSCRUN                       779
#define BAUDCON1                      780
#define BAUDCON1_ABDEN                781
#define ABDEN1                        782
#define BAUDCON1_WUE                  783
#define WUE1                          784
#define W4E                           785
#define BRG161                        786
#define BAUDCON1_BRG16                787
#define CKTXP                         788
#define BAUDCON1_TXCKP                789
#define SCKP1                         790
#define TXCKP1                        791
#define SCKP                          792
#define DTRXP1                        793
#define RXDTP1                        794
#define DTRXP                         795
#define RXCKP                         796
#define BAUDCON1_RXDTP                797
#define RCMT1                         798
#define RCIDL1                        799
#define BAUDCON1_RCIDL                800
#define RCMT                          801
#define ABDOVF1                       802
#define BAUDCON1_ABDOVF               803
#define LCDDATA0                      804
#define S00C0                         805
#define S01C0                         806
#define S02C0                         807
#define S03C0                         808
#define S04C0                         809
#define S05C0                         810
#define S06C0                         811
#define S07C0                         812
#define LCDDATA1                      813
#define S08C0                         814
#define S09C0                         815
#define S10C0                         816
#define S11C0                         817
#define S12C0                         818
#define S13C0                         819
#define S14C0                         820
#define S15C0                         821
#define LCDDATA2                      822
#define S16C0                         823
#define S17C0                         824
#define S18C0                         825
#define S19C0                         826
#define S20C0                         827
#define S21C0                         828
#define S22C0                         829
#define S23C0                         830
#define LCDDATA3                      831
#define S24C0                         832
#define S25C0                         833
#define S26C0                         834
#define S27C0                         835
#define S28C0                         836
#define S29C0                         837
#define S30C0                         838
#define S31C0                         839
#define LCDDATA4                      840
#define S32C0                         841
#define LCDDATA6                      842
#define S00C1                         843
#define S01C1                         844
#define S02C1                         845
#define S03C1                         846
#define S04C1                         847
#define S05C1                         848
#define S06C1                         849
#define S07C1                         850
#define LCDDATA7                      851
#define S08C1                         852
#define S09C1                         853
#define S10C1                         854
#define S11C1                         855
#define S12C1                         856
#define S13C1                         857
#define S14C1                         858
#define S15C1                         859
#define LCDDATA8                      860
#define S16C1                         861
#define S17C1                         862
#define S18C1                         863
#define S19C1                         864
#define S20C1                         865
#define S21C1                         866
#define S22C1                         867
#define S23C1                         868
#define LCDDATA9                      869
#define S24C1                         870
#define S25C1                         871
#define S26C1                         872
#define S27C1                         873
#define S28C1                         874
#define S29C1                         875
#define S30C1                         876
#define S31C1                         877
#define LCDDATA10                     878
#define S32C1                         879
#define LCDDATA12                     880
#define SSPM012                       881
#define S00C2                         882
#define S01C2                         883
#define SSPM112                       884
#define SSPM212                       885
#define S02C2                         886
#define S03C2                         887
#define SSPM312                       888
#define S04C2                         889
#define S05C2                         890
#define S06C2                         891
#define S07C2                         892
#define LCDDATA13                     893
#define S08C2                         894
#define S09C2                         895
#define S10C2                         896
#define S11C2                         897
#define S12C2                         898
#define S13C2                         899
#define S14C2                         900
#define S15C2                         901
#define LCDDATA14                     902
#define LCDDATA14_MSK0                903
#define S16C2                         904
#define LCDDATA14_MSK1                905
#define S17C2                         906
#define LCDDATA14_MSK2                907
#define S18C2                         908
#define S19C2                         909
#define LCDDATA14_MSK3                910
#define LCDDATA14_MSK4                911
#define S20C2                         912
#define LCDDATA14_MSK5                913
#define S21C2                         914
#define LCDDATA14_MSK6                915
#define S22C2                         916
#define LCDDATA14_MSK7                917
#define S23C2                         918
#define LCDDATA15                     919
#define S24C2                         920
#define S25C2                         921
#define S26C2                         922
#define S27C2                         923
#define S28C2                         924
#define S29C2                         925
#define S30C2                         926
#define S31C2                         927
#define LCDDATA16                     928
#define S32C2                         929
#define T4CKPS016                     930
#define LCDDATA18                     931
#define S00C3                         932
#define S01C3                         933
#define S02C3                         934
#define S03C3                         935
#define S04C3                         936
#define S05C3                         937
#define S06C3                         938
#define S07C3                         939
#define LCDDATA19                     940
#define S08C3                         941
#define S09C3                         942
#define S10C3                         943
#define S11C3                         944
#define S12C3                         945
#define T3CKPS019                     946
#define T3CKPS119                     947
#define S13C3                         948
#define S14C3                         949
#define TMR3CS019                     950
#define TMR3CS119                     951
#define S15C3                         952
#define LCDDATA20                     953
#define S16C3                         954
#define S17C3                         955
#define S18C3                         956
#define S19C3                         957
#define S20C3                         958
#define S21C3                         959
#define S22C3                         960
#define S23C3                         961
#define LCDDATA21                     962
#define S24C3                         963
#define S25C3                         964
#define S26C3                         965
#define S27C3                         966
#define S28C3                         967
#define S29C3                         968
#define S30C3                         969
#define S31C3                         970
#define LCDDATA22                     971
#define S32C3                         972
#define EECON2                        973
#define EECON1                        974
#define EECON1_RD                     975
#define EECON1_WR                     976
#define WREN                          977
#define WRERR                         978
#define FREE                          979
#define CFGS                          980
#define EEFS                          981
#define EEPGD                         982
#define PORTA                         983
#define ULPWUIN                       984
#define AN0                           985
#define RA0                           986
#define SEG18                         987
#define AN1                           988
#define RA1                           989
#define AN2                           990
#define RA2                           991
#define VREF_MINUS                    992
#define AN3                           993
#define VREF_PLUS                     994
#define RA3                           995
#define SEG14                         996
#define T0CKI                         997
#define RA4                           998
#define SEG15                         999
#define AN4                           1000
#define T1CKI                         1001
#define LVDIN                         1002
#define RA5                           1003
#define T3G                           1004
#define CLKO                          1005
#define RA6                           1006
#define OSC2                          1007
#define CLKI                          1008
#define PORTA_RJPU                    1009
#define RA7                           1010
#define OSC1                          1011
#define PORTB                         1012
#define SEG30                         1013
#define FLT0                          1014
#define RB0                           1015
#define INT0                          1016
#define RB1                           1017
#define INT1                          1018
#define SEG8                          1019
#define RB2                           1020
#define INT2                          1021
#define CTED1                         1022
#define SEG9                          1023
#define SEG10                         1024
#define RB3                           1025
#define INT3                          1026
#define CCP2_PA2                      1027
#define CTED2                         1028
#define SEG11                         1029
#define RB4                           1030
#define KBI0                          1031
#define PGM                           1032
#define T3CKI                         1033
#define RB5                           1034
#define SEG29                         1035
#define KBI1                          1036
#define T1G                           1037
#define PGC                           1038
#define RB6                           1039
#define KBI2                          1040
#define PGD                           1041
#define RB7                           1042
#define KBI3                          1043
#define PORTC                         1044
#define SCKLI                         1045
#define RC0                           1046
#define SOSCO                         1047
#define SEG32                         1048
#define PORTC_PA2                     1049
#define PORTC_CCP2                    1050
#define RC1                           1051
#define SOSCI                         1052
#define SEG13                         1053
#define CCP1                          1054
#define PA1                           1055
#define RC2                           1056
#define SEG17                         1057
#define SCK1                          1058
#define SCL1                          1059
#define RC3                           1060
#define SEG16                         1061
#define SDI1                          1062
#define SDA1                          1063
#define RC4                           1064
#define SEG12                         1065
#define SDO1                          1066
#define RC5                           1067
#define SEG27                         1068
#define TX1                           1069
#define RC6                           1070
#define CK1                           1071
#define DT1                           1072
#define RX1                           1073
#define SEG28                         1074
#define RC7                           1075
#define PORTD                         1076
#define PSP0                          1077
#define RD0                           1078
#define CTPLS                         1079
#define AD0                           1080
#define SEG0                          1081
#define PSP1                          1082
#define RD1                           1083
#define T5CKI                         1084
#define T7G                           1085
#define AD1                           1086
#define SEG1                          1087
#define PSP2                          1088
#define RD2                           1089
#define AD2                           1090
