tiborsimon/embedded-tdd-headers/pic/8bit/pic18f65k90_tdd.h
#define SEG2                          1091
#define PSP3                          1092
#define RD3                           1093
#define AD3                           1094
#define SEG3                          1095
#define PSP4                          1096
#define RD4                           1097
#define AD4                           1098
#define SDO2                          1099
#define SEG4                          1100
#define PSP5                          1101
#define RD5                           1102
#define SDI2                          1103
#define AD5                           1104
#define SDA2                          1105
#define SEG5                          1106
#define SEG6                          1107
#define SCK2                          1108
#define PSP6                          1109
#define RD6                           1110
#define AD6                           1111
#define SCL2                          1112
#define SS2                           1113
#define PSP7                          1114
#define RD7                           1115
#define AD7                           1116
#define SEG7                          1117
#define PORTE                         1118
#define PD2                           1119
#define AD8                           1120
#define PORTE_RD                      1121
#define RDE                           1122
#define LCDBIAS1                      1123
#define RE0                           1124
#define AD9                           1125
#define PORTE_WR                      1126
#define WRE                           1127
#define LCDBIAS2                      1128
#define RE1                           1129
#define PC2                           1130
#define PORTE_CS                      1131
#define PB2                           1132
#define CCP10                         1133
#define AD10                          1134
#define LCDBIAS3                      1135
#define RE2                           1136
#define CCP9                          1137
#define COM0                          1138
#define CCP9E                         1139
#define AD11                          1140
#define RE3                           1141
#define PC3                           1142
#define PC3E                          1143
#define CCP8                          1144
#define PB3E                          1145
#define PB3                           1146
#define COM1                          1147
#define REFO                          1148
#define AD12                          1149
#define RE4                           1150
#define CCP8E                         1151
#define PC1                           1152
#define CCP7                          1153
#define COM2                          1154
#define CCP7E                         1155
#define AD13                          1156
#define RE5                           1157
#define PC1E                          1158
#define CCP6E                         1159
#define CCP6                          1160
#define PB1                           1161
#define COM3                          1162
#define AD14                          1163
#define RE6                           1164
#define PB1E                          1165
#define PORTE_CCP2                    1166
#define CCP2E                         1167
#define SEG31                         1168
#define PA2E                          1169
#define PORTE_PA2                     1170
#define AD15                          1171
#define RE7                           1172
#define PORTF                         1173
#define SEG19                         1174
#define C2OUTF                        1175
#define AN6                           1176
#define PORTF_C2OUT                   1177
#define RF1                           1178
#define CTDIN                         1179
#define PORTF_C1OUT                   1180
#define AN7                           1181
#define RF2                           1182
#define C1OUTF                        1183
#define SEG20                         1184
#define AN8                           1185
#define RF3                           1186
#define SEG21                         1187
#define CTMUI                         1188
#define C2INB                         1189
#define AN9                           1190
#define RF4                           1191
#define SEG22                         1192
#define C2INA                         1193
#define C1INB                         1194
#define RF5                           1195
#define SEG23                         1196
#define CVREF                         1197
#define AN10                          1198
#define C1INA                         1199
#define RF6                           1200
#define SEG24                         1201
#define AN11                          1202
#define SS1                           1203
#define AN5                           1204
#define RF7                           1205
#define SEG25                         1206
#define PORTG                         1207
#define CCP3                          1208
#define PA3                           1209
#define RG0                           1210
#define C3OUTG                        1211
#define PORTG_C3OUT                   1212
#define TX2                           1213
#define RG1                           1214
#define CK2                           1215
#define AN19                          1216
#define C3INA                         1217
#define RX2                           1218
#define RG2                           1219
#define DT2                           1220
#define AN18                          1221
#define CCP4                          1222
#define PD3                           1223
#define C3INB                         1224
#define RG3                           1225
#define AN17                          1226
#define CCP5                          1227
#define PD1                           1228
#define SEG26                         1229
#define C3INC                         1230
#define T7CKI                         1231
#define T5G                           1232
#define RG4                           1233
#define RTCC                          1234
#define AN16                          1235
#define PORTG_RJPU                    1236
#define RG5                           1237
#define LATA                          1238
#define LATA0                         1239
#define LA0                           1240
#define LATA1                         1241
#define LA1                           1242
#define LATA2                         1243
#define LA2                           1244
#define LATA3                         1245
#define LA3                           1246
#define LATA4                         1247
#define LA4                           1248
#define LATA5                         1249
#define LA5                           1250
#define LATA6                         1251
#define LA6                           1252
#define LATA7                         1253
#define LA7                           1254
#define LATB                          1255
#define LB0                           1256
#define LATB0                         1257
#define LB1                           1258
#define LATB1                         1259
#define LB2                           1260
#define LATB2                         1261
#define LB3                           1262
#define LATB3                         1263
#define LB4                           1264
#define LATB4                         1265
#define LB5                           1266
#define LATB5                         1267
#define LB6                           1268
#define LATB6                         1269
#define LB7                           1270
#define LATB7                         1271
#define LATC                          1272
#define LATC0                         1273
#define LC0                           1274
#define LATC1                         1275
#define LC1                           1276
#define LATC2                         1277
#define LC2                           1278
#define LATC3                         1279
#define LC3                           1280
#define LATC4                         1281
#define LC4                           1282
#define LATC5                         1283
#define LC5                           1284
#define LATC6                         1285
#define LC6                           1286
#define LATC7                         1287
#define LC7                           1288
#define LATD                          1289
#define LATD0                         1290
#define LD0                           1291
#define LATD1                         1292
#define LD1                           1293
#define LATD2                         1294
#define LD2                           1295
#define LATD3                         1296
#define LD3                           1297
#define LATD4                         1298
#define LD4                           1299
#define LATD5                         1300
#define LD5                           1301
#define LATD6                         1302
#define LD6                           1303
#define LATD7                         1304
#define LD7                           1305
#define LATE                          1306
#define LATE0                         1307
#define LE0                           1308
#define LATE1                         1309
#define LE1                           1310
#define LATE2                         1311
#define LE2                           1312
#define LATE3                         1313
#define LE3                           1314
#define LATE4                         1315
#define LE4                           1316
#define LATE5                         1317
#define LE5                           1318
#define LATE6                         1319
#define LE6                           1320
#define LATE7                         1321
#define LE7                           1322
#define LATF                          1323
#define LATF1                         1324
#define LF1                           1325
#define LF2                           1326
#define LATF2                         1327
#define LF3                           1328
#define LATF3                         1329
#define LF4                           1330
#define LATF4                         1331
#define LF5                           1332
#define LATF5                         1333
#define LF6                           1334
#define LATF6                         1335
#define LF7                           1336
#define LATF7                         1337
#define LATG                          1338
#define LATG0                         1339
#define LG0                           1340
#define LATG1                         1341
#define LG1                           1342
#define LATG2                         1343
#define LG2                           1344
#define LATG3                         1345
#define LG3                           1346
#define LATG4                         1347
#define LG4                           1348
#define TRISA                         1349
#define TRISA0                        1350
#define TRISA1                        1351
#define TRISA2                        1352
#define TRISA3                        1353
#define TRISA4                        1354
#define TRISA5                        1355
#define TRISA6                        1356
#define TRISA7                        1357
#define TRISB                         1358
#define TRISB0                        1359
#define TRISB1                        1360
#define TRISB2                        1361
#define TRISB3                        1362
#define TRISB4                        1363
#define TRISB5                        1364
#define TRISB6                        1365
#define TRISB7                        1366
#define TRISC                         1367
#define TRISC0                        1368
#define TRISC1                        1369
#define TRISC2                        1370
#define TRISC3                        1371
#define TRISC4                        1372
#define TRISC5                        1373
#define TRISC6                        1374
#define TRISC7                        1375
#define TRISD                         1376
#define TRISD0                        1377
#define TRISD1                        1378
#define TRISD2                        1379
#define TRISD3                        1380
#define TRISD4                        1381
#define TRISD5                        1382
#define TRISD6                        1383
#define TRISD7                        1384
#define TRISE                         1385
#define TRISE0                        1386
#define TRISE1                        1387
#define TRISE2                        1388
#define TRISE3                        1389
#define TRISE4                        1390
#define TRISE5                        1391
#define TRISE6                        1392
#define TRISE7                        1393
#define TRISF                         1394
#define TRISF1                        1395
#define TRISF2                        1396
#define TRISF3                        1397
#define TRISF4                        1398
#define TRISF5                        1399
#define TRISF6                        1400
#define TRISF7                        1401
#define TRISG                         1402
#define TRISG0                        1403
#define TRISG1                        1404
#define TRISG2                        1405
#define TRISG3                        1406
#define TRISG4                        1407
#define OSCTUNE                       1408
#define TUN0                          1409
#define TUN                           1410
#define TUN1                          1411
#define TUN2                          1412
#define TUN3                          1413
#define TUN4                          1414
#define TUN5                          1415
#define PLLEN                         1416
#define INTSRC                        1417
#define PSTR1CON                      1418
#define PSTR1CON_STRA                 1419
#define PSTR1CON_STRB                 1420
#define PSTR1CON_STRC                 1421
#define PSTR1CON_STRD                 1422
#define PSTR1CON_STRSYNC              1423
#define PSTR1CON_CMPL0                1424
#define PSTR1CON_CMPL                 1425
#define PSTR1CON_CMPL1                1426
#define PIE1                          1427
#define TMR1IE                        1428
#define TMR2IE                        1429
#define TMR1GIE                       1430
#define SSP1IE                        1431
#define SSPIE                         1432
#define TXIE                          1433
#define TX1IE                         1434
#define RCIE                          1435
#define RC1IE                         1436
#define ADIE                          1437
#define PIR1                          1438
#define TMR1IF                        1439
#define TMR2IF                        1440
#define TMR1GIF                       1441
#define SSPIF                         1442
#define SSP1IF                        1443
#define TXIF                          1444
#define TX1IF                         1445
#define RCIF                          1446
#define RC1IF                         1447
#define ADIF                          1448
#define IPR1                          1449
#define TMR1IP                        1450
#define TMR2IP                        1451
#define TMR1GIP                       1452
#define SSPIP                         1453
#define SSP1IP                        1454
#define TX1IP                         1455
#define TXIP                          1456
#define RCIP                          1457
#define RC1IP                         1458
#define ADIP                          1459
#define PIE2                          1460
#define TMR3GIE                       1461
#define TMR3IE                        1462
#define HLVDIE                        1463
#define LVDIE                         1464
#define BCL1IE                        1465
#define BCLIE                         1466
#define BCL2IE                        1467
#define SSP2IE                        1468
#define OSCFIE                        1469
#define PIR2                          1470
#define TMR3GIF                       1471
#define TMR3IF                        1472
#define HLVDIF                        1473
#define LVDIF                         1474
#define BCLIF                         1475
#define BCL1IF                        1476
#define BCL2IF                        1477
#define SSP2IF                        1478
#define OSCFIF                        1479
#define IPR2                          1480
#define TMR3GIP                       1481
#define TMR3IP                        1482
#define HLVDIP                        1483
#define LVDIP                         1484
#define BCLIP                         1485
#define BCL1IP                        1486
#define BCL2IP                        1487
#define SSP2IP                        1488
#define OSCFIP                        1489
#define PIE3                          1490
#define RXB0IE                        1491
#define RTCCIE                        1492
#define RXBNIE                        1493
#define CCP1IE                        1494
#define RXB1IE                        1495
#define CCP2IE                        1496
#define TXB0IE                        1497
#define CTMUIE                        1498
#define TXB1IE                        1499
#define TXBNIE                        1500
#define TXB2IE                        1501
#define TX2IE                         1502
#define RC2IE                         1503
#define LCDIE                         1504
#define TMR5GIE                       1505
#define PIR3                          1506
#define RTCCIF                        1507
#define RXBNIF                        1508
#define CCP1IF                        1509
#define CCP2IF                        1510
#define CTMUIF                        1511
#define TXBNIF                        1512
#define TX2IF                         1513
#define RC2IF                         1514
#define LCDIF                         1515
#define TMR5GIF                       1516
#define IPR3                          1517
#define RTCCIP                        1518
#define CCP1IP                        1519
#define RXBNIP                        1520
#define CCP2IP                        1521
#define CTMUIP                        1522
#define TX2IP                         1523
#define TXBNIP                        1524
#define RC2IP                         1525
#define LCDIP                         1526
#define TMR5GIP                       1527
#define PIR6                          1528
#define CMP1IF                        1529
#define CMP2IF                        1530
#define CMP3IF                        1531
#define EEIF                          1532
#define HLVDCON                       1533
#define HLVDL                         1534
#define HLVDL0                        1535
#define HLVDL1                        1536
#define HLVDL2                        1537
#define HLVDL3                        1538
#define HLVDEN                        1539
#define IRVST                         1540
#define BGVST                         1541
#define VDIRMAG                       1542
#define IPR6                          1543
#define CMP1IP                        1544
#define CMP2IP                        1545
#define CMP3IP                        1546
#define EEIP                          1547
#define T1GCON                        1548
#define T1GSS0                        1549
#define T1GSS                         1550
#define T1GSS1                        1551
#define T1GVAL                        1552
#define T1GGO_nT1DONE                 1553
#define nT1DONE                       1554
#define T1GGO_NOT_T1DONE              1555
#define NOT_T1DONE                    1556
#define T1GGO                         1557
#define T1GSPM                        1558
#define T1GTM                         1559
#define T1GPOL                        1560
#define TMR1GE                        1561
#define RCSTA1                        1562
#define RCSTA1_RX9D                   1563
#define RX9D1                         1564
#define RCD8                          1565
#define RCSTA1_OERR                   1566
#define OERR1                         1567
#define RCSTA1_FERR                   1568
#define FERR1                         1569
#define RCSTA1_ADDEN                  1570
#define ADDEN1                        1571
#define ADEN                          1572
#define RCSTA1_CREN                   1573
#define CREN1                         1574
#define SRENA                         1575
#define SREN1                         1576
#define RCSTA1_SREN                   1577
#define RC8_9                         1578
#define RCSTA1_RX9                    1579
#define nRC8                          1580
#define NOT_RC8                       1581
#define RC9                           1582
#define RX91                          1583
#define RCSTA1_SPEN                   1584
#define SPEN1                         1585
#define TXSTA1                        1586
#define TX9D1                         1587
#define TXSTA1_TX9D                   1588
#define TXD8                          1589
#define TRMT1                         1590
#define TXSTA1_TRMT                   1591
#define BRGH1                         1592
#define TXSTA1_BRGH                   1593
#define TXSTA1_SENDB                  1594
#define SENDB1                        1595
#define TXSTA1_SYNC                   1596
#define SYNC1                         1597
#define TXEN1                         1598
#define TXSTA1_TXEN                   1599
#define TX91                          1600
#define TX8_9                         1601
#define NOT_TX8                       1602
#define nTX8                          1603
#define TXSTA1_TX9                    1604
#define TXSTA1_CSRC                   1605
#define CSRC1                         1606
#define TXREG1                        1607
#define RCREG1                        1608
#define SPBRG1                        1609
#define T3GCON                        1610
#define T3GSS0                        1611
#define T3GSS                         1612
#define T3GSS1                        1613
#define T3GVAL                        1614
#define T3GGO                         1615
#define NOT_T3DONE                    1616
#define nT3DONE                       1617
#define T3GGO_nT3DONE                 1618
#define T3GGO_NOT_T3DONE              1619
#define T3GSPM                        1620
#define T3GTM                         1621
#define T3GPOL                        1622
#define TMR3GE                        1623
#define T3CON                         1624
#define TMR3ON                        1625
#define T3CON_RD16                    1626
#define nT3SYNC                       1627
#define NOT_T3SYNC                    1628
#define SOSCEN3                       1629
#define T3CON_SOSCEN                  1630
#define T3CKPS0                       1631
#define T3CKPS                        1632
#define T3CKPS1                       1633
#define TMR3CS                        1634
#define TMR3CS0                       1635
#define TMR3CS1                       1636
#define T3RD16                        1637
#define RD163                         1638
#define TMR3L                         1639
#define TMR3H                         1640
#define CMSTAT                        1641
#define CMSTAT_C1OUT                  1642
#define CMP1OUT                       1643
#define CMSTAT_C2OUT                  1644
#define CMP2OUT                       1645
#define CMP3OUT                       1646
#define CMSTAT_C3OUT                  1647
#define CVRCON                        1648
