tiborsimon/embedded-tdd-headers/pic/8bit/pic18f65k90_tdd.h
#define CVR                           1649
#define CVR0                          1650
#define CVR1                          1651
#define CVR2                          1652
#define CVR3                          1653
#define CVR4                          1654
#define CVRR                          1655
#define CVRSS                         1656
#define CVROEN                        1657
#define CVROE                         1658
#define CVREN                         1659
#define PIE4                          1660
#define CCP3IE                        1661
#define CCP4IE                        1662
#define CCP5IE                        1663
#define CCP6IE                        1664
#define CCP7IE                        1665
#define CCP8IE                        1666
#define PIR4                          1667
#define CCP3IF                        1668
#define CCP4IF                        1669
#define CCP5IF                        1670
#define CCP6IF                        1671
#define CCP7IF                        1672
#define CCP8IF                        1673
#define IPR4                          1674
#define CCP3IP                        1675
#define CCIP3IP                       1676
#define CCP4IP                        1677
#define CCP5IP                        1678
#define CCP6IP                        1679
#define CCP7IP                        1680
#define CCP8IP                        1681
#define PIE5                          1682
#define TMR4IE                        1683
#define TMR5IE                        1684
#define TMR6IE                        1685
#define TMR8IE                        1686
#define PIR5                          1687
#define TMR4IF                        1688
#define TMR5IF                        1689
#define TMR6IF                        1690
#define TMR8IF                        1691
#define CCP1CON                       1692
#define CCP1M0                        1693
#define CCP1M                         1694
#define CCP1M1                        1695
#define CCP1M2                        1696
#define CCP1M3                        1697
#define CCP1Y                         1698
#define DC1B                          1699
#define DC1B0                         1700
#define CCP1X                         1701
#define DC1B1                         1702
#define P1M                           1703
#define P1M0                          1704
#define P1M1                          1705
#define CCPR1L                        1706
#define CCPR1H                        1707
#define ECCP1DEL                      1708
#define P1DC                          1709
#define P1DC0                         1710
#define P1DC1                         1711
#define P1DC2                         1712
#define P1DC3                         1713
#define P1DC4                         1714
#define P1DC5                         1715
#define P1DC6                         1716
#define P1RSEN                        1717
#define PSS1BD0                       1718
#define PSS1BD                        1719
#define PSS1BD1                       1720
#define PSS1AC                        1721
#define PSS1AC0                       1722
#define PSS1AC1                       1723
#define ECCP1AS                       1724
#define ECCP1AS0                      1725
#define ECCP1AS1                      1726
#define ECCP1AS2                      1727
#define ECCP1ASE                      1728
#define ADCON2                        1729
#define ADCS0                         1730
#define ADCS                          1731
#define ADCS1                         1732
#define ADCS2                         1733
#define ACQT0                         1734
#define ACQT                          1735
#define ACQT1                         1736
#define ACQT2                         1737
#define ADFM                          1738
#define ADCON1                        1739
#define CHSN0                         1740
#define CHSN                          1741
#define CHSN1                         1742
#define CHSN2                         1743
#define VNCFG                         1744
#define CHSN3                         1745
#define VCFG                          1746
#define VCFG01                        1747
#define VCFG0                         1748
#define VCFG11                        1749
#define VCFG1                         1750
#define TRIGSEL                       1751
#define TRIGSEL0                      1752
#define TRIGSEL1                      1753
#define ADCON0                        1754
#define ADON                          1755
#define nDONE                         1756
#define GO_nDONE                      1757
#define NOT_DONE                      1758
#define GODONE                        1759
#define GO_DONE                       1760
#define DONE                          1761
#define GO_NOT_DONE                   1762
#define GO                            1763
#define CHS0                          1764
#define CHS                           1765
#define CHS1                          1766
#define CHS2                          1767
#define CHS3                          1768
#define CHS4                          1769
#define ADRESL                        1770
#define ADRESH                        1771
#define SSP1CON2                      1772
#define SEN1                          1773
#define SSP1CON2_SEN                  1774
#define ADMSK11                       1775
#define SSP1CON2_RSEN                 1776
#define RSEN1                         1777
#define SSP1CON2_ADMSK1               1778
#define SSP1CON2_PEN                  1779
#define ADMSK21                       1780
#define PEN1                          1781
#define SSP1CON2_ADMSK2               1782
#define ADMSK31                       1783
#define RCEN1                         1784
#define SSP1CON2_RCEN                 1785
#define SSP1CON2_ADMSK3               1786
#define SSP1CON2_ACKEN                1787
#define ACKEN1                        1788
#define ADMSK41                       1789
#define SSP1CON2_ADMSK4               1790
#define ACKDT1                        1791
#define ADMSK51                       1792
#define SSP1CON2_ACKDT                1793
#define SSP1CON2_ADMSK5               1794
#define SSP1CON2_ACKSTAT              1795
#define ACKSTAT1                      1796
#define GCEN1                         1797
#define SSP1CON2_GCEN                 1798
#define SSP1CON1                      1799
#define SSP1CON1_SSPM0                1800
#define SSPM01                        1801
#define SSP1CON1_SSPM                 1802
#define SSP1CON1_SSPM1                1803
#define SSPM11                        1804
#define SSP1CON1_SSPM2                1805
#define SSPM21                        1806
#define SSPM31                        1807
#define SSP1CON1_SSPM3                1808
#define SSP1CON1_CKP                  1809
#define CKP1                          1810
#define SSPEN1                        1811
#define SSP1CON1_SSPEN                1812
#define SSPOV1                        1813
#define SSP1CON1_SSPOV                1814
#define WCOL1                         1815
#define SSP1CON1_WCOL                 1816
#define SSP1STAT                      1817
#define BF1                           1818
#define SSP1STAT_BF                   1819
#define UA1                           1820
#define SSP1STAT_UA                   1821
#define SSP1STAT_R_NOT_W              1822
#define RW1                           1823
#define NOT_W                         1824
#define SSP1STAT_R                    1825
#define SSP1STAT_nW                   1826
#define RW                            1827
#define SSP1STAT_READ_WRITE           1828
#define SSP1STAT_nWRITE               1829
#define SSP1STAT_I2C_READ             1830
#define SSP1STAT_R_W                  1831
#define SSP1STAT_NOT_WRITE            1832
#define SSP1STAT_R_nW                 1833
#define SSP1STAT_S                    1834
#define START                         1835
#define SSP1STAT_I2C_START            1836
#define START1                        1837
#define STOP                          1838
#define SSP1STAT_P                    1839
#define STOP1                         1840
#define SSP1STAT_I2C_STOP             1841
#define SSP1STAT_D                    1842
#define SSP1STAT_D_NOT_A              1843
#define NOT_A                         1844
#define SSP1STAT_D_A                  1845
#define SSP1STAT_D_nA                 1846
#define SSP1STAT_NOT_ADDRESS          1847
#define SSP1STAT_nA                   1848
#define DA1                           1849
#define DA                            1850
#define SSP1STAT_I2C_DAT              1851
#define SSP1STAT_nADDRESS             1852
#define SSP1STAT_DATA_ADDRESS         1853
#define SSP1STAT_CKE                  1854
#define CKE1                          1855
#define SSP1STAT_SMP                  1856
#define SMP1                          1857
#define SSP1ADD                       1858
#define SSP1ADD_MSK0                  1859
#define MSK01                         1860
#define SSPADD                        1861
#define SSP1ADD_MSK1                  1862
#define MSK11                         1863
#define SSP1ADD_MSK2                  1864
#define MSK21                         1865
#define MSK31                         1866
#define SSP1ADD_MSK3                  1867
#define SSP1ADD_MSK4                  1868
#define MSK41                         1869
#define MSK51                         1870
#define SSP1ADD_MSK5                  1871
#define MSK61                         1872
#define SSP1ADD_MSK6                  1873
#define SSP1ADD_MSK7                  1874
#define MSK71                         1875
#define SSP1BUF                       1876
#define SSPBUF                        1877
#define T2CON                         1878
#define T2CKPS0                       1879
#define T2CKPS                        1880
#define T2CKPS1                       1881
#define TMR2ON                        1882
#define T2OUTPS0                      1883
#define T2OUTPS                       1884
#define T2OUTPS1                      1885
#define T2OUTPS2                      1886
#define T2OUTPS3                      1887
#define WM0                           1888
#define PR2                           1889
#define WM1                           1890
#define WAIT0                         1891
#define WAIT1                         1892
#define EBDIS                         1893
#define TMR2                          1894
#define T1CON                         1895
#define TMR1ON                        1896
#define T1CON_RD16                    1897
#define NOT_T1SYNC                    1898
#define nT1SYNC                       1899
#define T1OSCEN                       1900
#define T1CON_SOSCEN                  1901
#define T1CKPS0                       1902
#define T1CKPS                        1903
#define T1CKPS1                       1904
#define TMR1CS0                       1905
#define TMR1CS                        1906
#define T1RD16                        1907
#define TMR1CS1                       1908
#define TMR1L                         1909
#define TMR1H                         1910
#define RCON                          1911
#define BOR                           1912
#define NOT_BOR                       1913
#define nBOR                          1914
#define POR                           1915
#define nPOR                          1916
#define NOT_POR                       1917
#define PD                            1918
#define nPD                           1919
#define NOT_PD                        1920
#define nTO                           1921
#define TO                            1922
#define NOT_TO                        1923
#define nRI                           1924
#define NOT_RI                        1925
#define RI                            1926
#define NOT_CM                        1927
#define CM                            1928
#define nCM                           1929
#define SBOREN                        1930
#define IPEN                          1931
#define WDTCON                        1932
#define SWDTEN                        1933
#define SWDTE                         1934
#define ULPSINK                       1935
#define ULPEN                         1936
#define SRETEN                        1937
#define ULPLVL                        1938
#define REGSLP                        1939
#define IPR5                          1940
#define CCH05                         1941
#define TMR4IP                        1942
#define CCH15                         1943
#define TMR5IP                        1944
#define TMR6IP                        1945
#define EVPOL15                       1946
#define TMR8IP                        1947
#define OSCCON                        1948
#define SCS0                          1949
#define SCS                           1950
#define SCS1                          1951
#define HFIOFS                        1952
#define OSTS                          1953
#define IRCF                          1954
#define IRCF0                         1955
#define IRCF1                         1956
#define IRCF2                         1957
#define IDLEN                         1958
#define SPBRGH1                       1959
#define T0CON                         1960
#define T0PS                          1961
#define T0PS0                         1962
#define T0PS1                         1963
#define T0PS2                         1964
#define PSA                           1965
#define T0SE                          1966
#define T0CS                          1967
#define T08BIT                        1968
#define TMR0ON                        1969
#define TMR0L                         1970
#define TMR0H                         1971
#define STATUS                        1972
#define C                             1973
#define CARRY                         1974
#define DC                            1975
#define ZERO                          1976
#define Z                             1977
#define OV                            1978
#define OVERFLOW                      1979
#define N                             1980
#define NEGATIVE                      1981
#define FSR2L                         1982
#define PLUSW2                        1983
#define PREINC2                       1984
#define POSTDEC2                      1985
#define POSTINC2                      1986
#define INDF2                         1987
#define FSR1L                         1988
#define PLUSW1                        1989
#define PREINC1                       1990
#define POSTDEC1                      1991
#define POSTINC1                      1992
#define INDF1                         1993
#define WREG                          1994
#define FSR0L                         1995
#define PLUSW0                        1996
#define PREINC0                       1997
#define POSTDEC0                      1998
#define POSTINC0                      1999
#define INDF0                         2000
#define INTCON3                       2001
#define INT1IF                        2002
#define INT1F                         2003
#define INT2IF                        2004
#define INT2F                         2005
#define INT3F                         2006
#define INT3IF                        2007
#define INT1E                         2008
#define INT1IE                        2009
#define INT2IE                        2010
#define INT2E                         2011
#define INT3E                         2012
#define INT3IE                        2013
#define INT1P                         2014
#define INT1IP                        2015
#define INT2IP                        2016
#define INT2P                         2017
#define INTCON2                       2018
#define RBIP                          2019
#define INT3IP                        2020
#define INT3P                         2021
#define TMR0IP                        2022
#define T0IP                          2023
#define INTEDG3                       2024
#define INTEDG2                       2025
#define INTEDG1                       2026
#define INTEDG0                       2027
#define RBPU                          2028
#define NOT_RBPU                      2029
#define nRBPU                         2030
#define INTCON                        2031
#define RBIF                          2032
#define INT0F                         2033
#define INT0IF                        2034
#define T0IF                          2035
#define TMR0IF                        2036
#define RBIE                          2037
#define INT0E                         2038
#define INT0IE                        2039
#define T0IE                          2040
#define TMR0IE                        2041
#define PEIE                          2042
#define PEIE_GIEL                     2043
#define GIEL                          2044
#define GIE_GIEH                      2045
#define GIE                           2046
#define GIEH                          2047
#define PRODL                         2048
#define PRODH                         2049
#define TABLAT                        2050
#define TBLPTRL                       2051
#define TBLPTRH                       2052
#define PCL                           2053
#define PCLATH                        2054
#define PCH                           2055
#define SP0                           2056
#define STKPTR                        2057
#define SP1                           2058
#define SP2                           2059
#define SP3                           2060
#define SP4                           2061
#define STKUNF                        2062
#define STKOVF                        2063
#define STKFUL                        2064
#define TOSL                          2065
#define TOSH                          2066

#endif // _PIC18F65K90_H_
